Revit 2027 API
BuiltInFailures.CurveFailures.LineTooShortError Property
 Line is too short.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LineTooShortError { get; }
Public Shared ReadOnly Property LineTooShortError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LineTooShortError {
	FailureDefinitionId^ get ();
}
static member LineTooShortError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace